In [152]:
import pandas as pd
import sqlite3
import os

In [153]:
path = os.path.abspath(os.path.join(os.getcwd(), os.path.pardir))

In [154]:
def create_connection(db_file):
    conn = None
    try:
        conn = sqlite3.connect(db_file)
    except Error as e:
        print(e)

    return conn

In [155]:
conn = create_connection(os.path.join(path, "data/league.db"))

In [176]:
sql = """
SELECT * 
FROM team_stats
"""
pd.read_sql_query(sql, conn)

,Club_Name,Result,Kills,First_Blood,Towers,First_Tower,Dragons,Barons,Gold,Ban_1,Ban_2,Ban_3,Ban_4,Ban_5,Pick_1,Pick_2,Pick_3,Pick_4,Pick_5,Match_id
0,Fenerbah√ße Academy,WIN,17,1.0,11,1,3,1.0,65.5k,Ryze,Lee,Volibear,Nautilus,Karma,Yasuo,Xin,LeBlanc,Xayah,Rakan,391210
1,Dark Passage Academy,WIN,23,1.0,7,0,4,1.0,65k,Irelia,Yone,Akali,Jayce,Yasuo,Jax,Viego,Viktor,Jinx,Leona,391211
2,Dark Passage Academy,LOSS,7,0.0,1,0,1,0.0,34.7k,Irelia,Yone,Akali,Jayce,Yasuo,Malphite,Hecarim,Viktor,Jinx,Leona,391212
3,Dark Passage Academy,LOSS,6,0.0,1,1,0,0.0,34.9k,Irelia,Yone,Akali,Jayce,Yasuo,Camille,Xin,Viktor,Jinx,Nautilus,391213
4,Riddle Esports,LOSS,9,0.0,0,0,3,0.0,42.2k,Zeri,Rell,Hecarim,Vex,LeBlanc,Malphite,Rumble,Irelia,Jhin,Sett,390410
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
57052,Gambit Gaming,WIN,25,0.0,10,1,3,2.0,64k,Kayle,Annie,Elise,None,None,Warwick,Lee,KhaZix,Jinx,Kennen,47100
57053,Alliance,LOSS,8,0.0,4,1,4,0.0,64.9k,Kassadin,Annie,Orianna,None,None,Shyvana,Lee,Gragas,Vayne,Thresh,47090
57054,Supa Hot Crew,LOSS,5,1.0,1,1,0,0.0,39.4k,Kassadin,Lee,Annie,None,None,Renekton,Nunu,Gragas,Caitlyn,Nami,47080
57055,Copenhagen Wolves,WIN,14,0.0,10,0,4,1.0,70.9k,Lee,Annie,Yasuo,None,None,Shyvana,Elise,Kayle,Lucian,Lulu,47070
57056,Fnatic,WIN,21,1.0,10,1,0,1.0,59.4k,Riven,KhaZix,Yasuo,None,None,Trundle,Vi,Orianna,Jinx,Annie,47060

In [157]:
sql = """
SELECT * from team_stats
GROUP BY Result
"""
pd.read_sql_query(sql, conn)

,Club_Name,Result,Kills,First_Blood,Towers,First_Tower,Dragons,Barons,Gold,Ban_1,Ban_2,Ban_3,Ban_4,Ban_5,Pick_1,Pick_2,Pick_3,Pick_4,Pick_5,Match_id
0,Najin e,Emfire,3,1.0,4,0,0,0,60.7k,Lulu,Twisted,Viktor,None,None,Fiora,Elise,LeBlanc,Ashe,Alistar,21200
1,H2k,Gaming,15,1.0,2,0,1,0,65.6k,Poppy,Jhin,Ryze,None,None,Kennen,Olaf,Cassiopeia,Sivir,Zyra,46980
2,Paris Saint,Germain,18,1.0,10,1,5,2,94.2k,Twitch,KogMaw,Galio,Shen,Jayce,Renekton,Elise,Cassiopeia,Ashe,Lulu,80410
3,Dark Passage Academy,LOSS,7,0.0,1,0,1,0,34.7k,Irelia,Yone,Akali,Jayce,Yasuo,Malphite,Hecarim,Viktor,Jinx,Leona,391212
4,E,MonkeyzClub,10,1.0,6,0,5,1,62.4k,Kalista,Neeko,Jayce,Morgana,Galio,Renekton,Jarvan,Azir,Ashe,Tahm,164720
5,G,Rex,19,0.0,8,0,3,1,71.4k,Kalista,Thresh,Lissandra,Ryze,Gangplank,Aatrox,Sejuani,Corki,Vayne,Braum,163060
6,R,SIXTEAM,33,1.0,10,1,4,3,87.5k,Irelia,Viktor,Nocturne,Vayne,Kaisa,Sion,Camille,LeBlanc,Ezreal,Braum,148121
7,E WIE EINFACH E,SPORTS,25,0.0,10,0,3,2,65k,Zeri,Aphelios,Gwen,Lulu,Thresh,Malphite,Graves,Vex,Karthus,Pyke,378260
8,INTZ e,Sports,7,1.0,2,0,1,0,39.7k,Jinx,Kaisa,Viego,Twisted,Galio,Irelia,Volibear,Syndra,Lucian,Yuumi,389330
9,ahq e,SportsClub,10,1.0,3,0,2,0,63.5k,Twisted,Galio,Sett,LeBlanc,Syndra,Gnar,Jarvan,Orianna,Jhin,Lulu,265200
10,Fenerbah√ße Academy,WIN,17,1.0,11,1,3,1,65.5k,Ryze,Lee,Volibear,Nautilus,Karma,Yasuo,Xin,LeBlanc,Xayah,Rakan,391210

#FOUND SOME UNVALID DATA

In [177]:
sql = """
SELECT * 
FROM team_stats
WHERE Result IN ("WIN", "LOSS")
"""
pd.read_sql_query(sql, conn)

,Club_Name,Result,Kills,First_Blood,Towers,First_Tower,Dragons,Barons,Gold,Ban_1,Ban_2,Ban_3,Ban_4,Ban_5,Pick_1,Pick_2,Pick_3,Pick_4,Pick_5,Match_id
0,Fenerbah√ße Academy,WIN,17,1.0,11,1,3,1.0,65.5k,Ryze,Lee,Volibear,Nautilus,Karma,Yasuo,Xin,LeBlanc,Xayah,Rakan,391210
1,Dark Passage Academy,WIN,23,1.0,7,0,4,1.0,65k,Irelia,Yone,Akali,Jayce,Yasuo,Jax,Viego,Viktor,Jinx,Leona,391211
2,Dark Passage Academy,LOSS,7,0.0,1,0,1,0.0,34.7k,Irelia,Yone,Akali,Jayce,Yasuo,Malphite,Hecarim,Viktor,Jinx,Leona,391212
3,Dark Passage Academy,LOSS,6,0.0,1,1,0,0.0,34.9k,Irelia,Yone,Akali,Jayce,Yasuo,Camille,Xin,Viktor,Jinx,Nautilus,391213
4,Riddle Esports,LOSS,9,0.0,0,0,3,0.0,42.2k,Zeri,Rell,Hecarim,Vex,LeBlanc,Malphite,Rumble,Irelia,Jhin,Sett,390410
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
55411,Gambit Gaming,WIN,25,0.0,10,1,3,2.0,64k,Kayle,Annie,Elise,None,None,Warwick,Lee,KhaZix,Jinx,Kennen,47100
55412,Alliance,LOSS,8,0.0,4,1,4,0.0,64.9k,Kassadin,Annie,Orianna,None,None,Shyvana,Lee,Gragas,Vayne,Thresh,47090
55413,Supa Hot Crew,LOSS,5,1.0,1,1,0,0.0,39.4k,Kassadin,Lee,Annie,None,None,Renekton,Nunu,Gragas,Caitlyn,Nami,47080
55414,Copenhagen Wolves,WIN,14,0.0,10,0,4,1.0,70.9k,Lee,Annie,Yasuo,None,None,Shyvana,Elise,Kayle,Lucian,Lulu,47070
55415,Fnatic,WIN,21,1.0,10,1,0,1.0,59.4k,Riven,KhaZix,Yasuo,None,None,Trundle,Vi,Orianna,Jinx,Annie,47060

In [159]:
sql = """
SELECT 
Club_Name,
COUNT(CLub_Name) Total_Games,
ROW_NUMBER() OVER (ORDER BY Count(CLub_Name) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

           Club_Name  Total_Games  Row_Number
0        KT Rolster           702           1
1            Fnatic           617           2
2    Afreeca Freecs           588           3
3       Team Liquid           536           4
4        G2 Esports           513           5
..               ...          ...         ...
760           FALKN             2         761
761        Chungnam             2         762
762      SDX Gaming             1         763
763        Random 5             1         764
764        Gyeonggi             1         765

[765 rows x 3 columns]

In [178]:
sql = """
SELECT 
Club_Name,
SUM(Kills) Total_Kills,
ROW_NUMBER() OVER (ORDER BY SUM(Kills) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

                 Club_Name  Total_Kills  Row_Number
0                  Fnatic          8492           1
1              KT Rolster          8379           2
2              G2 Esports          7277           3
3             Team Liquid          6813           4
4     Royal Never Give Up          6557           5
..                     ...          ...         ...
760              Gyeonggi            10         761
761              Chungnam             9         762
762         I Gaming Star             8         763
763  GC Busan Rising Star             5         764
764              Random 5             3         765

[765 rows x 3 columns]

In [161]:
sql = """
SELECT 
Club_Name,
COUNT(Club_Name) Total_Games,
AVG(Gold),
ROW_NUMBER() OVER (ORDER BY AVG(Gold) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

        Club_Name  Total_Games  AVG(Gold)  Row_Number
0          Crew e            4  73.775000           1
1           RAMS             9  72.300000           2
2    ahq eSports            23  71.800000           3
3          I MAY             6  71.233333           4
4     Keyd Stars            44  70.870455           5
..            ...          ...        ...         ...
760    Besiktas E            5  36.940000         761
761     Random 5             1  36.900000         762
762      Mineski             2  36.900000         763
763          CMG             4  32.925000         764
764     Chungnam             2  32.150000         765

[765 rows x 4 columns]

In [162]:
sql = """
SELECT 
Club_Name,
COUNT(Club_Name) Total_Games,
AVG(Kills),
ROW_NUMBER() OVER (ORDER BY AVG(Kills) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

                 Club_Name  Total_Games  AVG(Kills)  Row_Number
0              SDX Gaming             1   24.000000           1
1            LPL Allstars             4   23.000000           2
2       Cloud9 Challenger             3   22.666667           3
3    Samsung Galaxy White            17   22.588235           4
4         SK Telecom T1 K             9   21.777778           5
..                     ...          ...         ...         ...
760                  Ever             4    4.750000         761
761              Chungnam             2    4.500000         762
762         I Gaming Star             2    4.000000         763
763              Random 5             1    3.000000         764
764  GC Busan Rising Star             2    2.500000         765

[765 rows x 4 columns]

In [163]:
sql = """
SELECT 
Ban_1,
Count(Ban_1) total_bans_1,
ROW_NUMBER() OVER (ORDER BY Count(Ban_1) DESC) Row_Number
FROM team_stats
GROUP BY Ban_1
"""
pd.read_sql_query(sql, conn)

       Ban_1  total_bans_1  Row_Number
0    LeBlanc          1750           1
1     Thresh          1654           2
2    Kalista          1634           3
3        Zoe          1548           4
4    Camille          1481           5
..       ...           ...         ...
155    Amumu             7         156
156  Warwick             5         157
157    Nasus             5         158
158    Teemo             4         159
159    Garen             2         160

[160 rows x 3 columns]

In [179]:
sql = """
SELECT 
Pick_1,
Count(Pick_1) total_picks_1,
ROW_NUMBER() OVER (ORDER BY Count(Pick_1) DESC) Row_Number
FROM team_stats
GROUP BY Pick_1
"""
pd.read_sql_query(sql, conn)

         Pick_1  total_picks_1  Row_Number
0          Gnar           4496           1
1      Renekton           4107           2
2          Ornn           3728           3
3       Camille           3003           4
4        Aatrox           2895           5
..          ...            ...         ...
120       Elise              1         121
121      Draven              1         122
122     Caitlyn              1         123
123  Blitzcrank              1         124
124       Amumu              1         125

[125 rows x 3 columns]

In [180]:
sql = """
SELECT 
Pick_5,
Count(Pick_1) total_picks_5,
ROW_NUMBER() OVER (ORDER BY Count(Pick_5) DESC) Row_Number
FROM team_stats
GROUP BY Pick_5
"""
pd.read_sql_query(sql, conn)

         Pick_5  total_picks_5  Row_Number
0         Braum           6488           1
1        Thresh           6265           2
2       Alistar           5323           3
3      Nautilus           4785           4
4         Leona           4487           5
..          ...            ...         ...
82   Cassiopeia              1          83
83      Caitlyn              1          84
84     Aurelion              1          85
85       Anivia              1          86
86       Aatrox              1          87

[87 rows x 3 columns]

In [181]:
sql = """
SELECT 
Club_Name,
SUM(First_Blood) Total_First_Blood,
ROW_NUMBER() OVER (ORDER BY SUM(First_Blood) DESC) Row_Number
FROM team_stats
GROUP BY Club_Name
"""
pd.read_sql_query(sql, conn)

                 Club_Name  Total_First_Blood  Row_Number
0              KT Rolster               395.0           1
1                  Fnatic               354.0           2
2          Afreeca Freecs               314.0           3
3             Team Liquid               284.0           4
4              G2 Esports               256.0           5
..                     ...                ...         ...
760            Gama Dream                 0.0         761
761  GC Busan Rising Star                 0.0         762
762  Dynamo Eclot Academy                 0.0         763
763             Bigetron E                0.0         764
764       Armored Project                 0.0         765

[765 rows x 3 columns]

In [182]:
sql = """
SELECT * 
FROM General_data
"""
pd.read_sql_query(sql, conn)

,Match_id,Date,Blue_Team,Red_Team,Tournament,Time,Game_Version
0,391210,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,33:41,v12.5
1,391211,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,34:54,v12.5
2,391212,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,22:06,v12.5
3,391213,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,22:26,v12.5
4,390410,2022-03-21 (ROUND2),RDL,Dusty,NLC Spring Playoffs 2022,26:38,v12.5
...,...,...,...,...,...,...,...
30958,47100,2014-01-14 (WEEK1),GMB,CW,EU LCS Spring 2014,30:37,v3.15
30959,47090,2014-01-14 (WEEK1),Alliance,Fnatic,EU LCS Spring 2014,43:49,v3.15
30960,47080,2014-01-14 (WEEK1),SHC,Roccat,EU LCS Spring 2014,31:14,v3.15
30961,47070,2014-01-14 (WEEK1),CW,Alliance,EU LCS Spring 2014,41:14,v3.15
30962,47060,2014-01-14 (WEEK1),Fnatic,GMB,EU LCS Spring 2014,32:04,v3.15

In [168]:
sql = """
SELECT Tournament 
FROM General_data
GROUP BY Tournament
"""
pd.read_sql_query(sql, conn)

                          Tournament
0                      All Star 2015
1                      All-Star 2014
2                  BRCC Split 1 2020
3         BRCC Split 1 Playoffs 2020
4                  BRCC Split 2 2020
..                               ...
560  World Championship Play-In 2017
561  World Championship Play-In 2018
562  World Championship Play-In 2019
563  World Championship Play-In 2020
564  World Championship Play-In 2021

[565 rows x 1 columns]

In [183]:
sql = """
SELECT Tournament,
AVG(Time),
ROW_NUMBER() OVER (ORDER BY AVG(TIME)) Row_Number
FROM General_data
GROUP BY Tournament
LIMIT 10
"""
pd.read_sql_query(sql, conn)

                            Tournament  AVG(Time)  Row_Number
0                   Hitpoint LEGENDS 1  26.444444           1
1            Hitpoint Masters Season 9  27.307692           2
2               NA-EU Rift Rivals 2019  27.384615           3
3                EBL Season 8 Playoffs  27.700000           4
4  Turkey Academy Winter Playoffs 2022  27.750000           5
5                      LST Summer 2019  28.048387           6
6            LJL Academy Playoffs 2021  28.222222           7
7                      VCS Spring 2022  28.320000           8
8             LFL Summer Playoffs 2020  28.500000           9
9             LCL Summer Playoffs 2020  29.000000          10

In [170]:
sql = """
SELECT Game_Version,
COUNT(Match_id),
ROW_NUMBER() OVER (ORDER BY COUNT(Game_Version) DESC) Row_Number
FROM General_data
GROUP BY Game_Version
"""
pd.read_sql_query(sql, conn)

    Game_Version  COUNT(Match_id)  Row_Number
0         v11.15              824           1
1         v11.13              643           2
2          v12.3              623           3
3          v8.13              619           4
4          v12.4              619           5
..           ...              ...         ...
142        v7.23               11         143
143        v5.21               11         144
144       v10.18               11         145
145         v6.7               10         146
146        v9.21                9         147

[147 rows x 3 columns]

In [171]:
sql = """
SELECT *
FROM Players_stats
"""
pd.read_sql_query(sql, conn)

,Player_Nickname,KDA,CS,Damage_Distribution,Gold_Distribution,Champion,Role,Match_id
0,Tholem,2/3/7,239,18.2%,18.9%,Gragas,Top,391210
1,chef,3/3/10,186,25.8%,19.6%,Hecarim,Jungle,391210
2,Avarosa,5/4/7,261,24.3%,22.8%,Ahri,Mid,391210
3,Pako,7/2/7,324,24.4%,26.1%,Jinx,Adc,391210
4,monkaS,0/5/15,37,7.3%,12.6%,Leona,Support,391210
...,...,...,...,...,...,...,...,...
256250,Svenskeren,0/4/1,225,12.1%,20.3%,Graves,Jungle,245350
256251,Jiizuke,0/6/1,209,16.6%,18.9%,Karma,Mid,245350
256252,Bang,0/1/1,288,35.7%,23.8%,Ezreal,Adc,245350
256253,Zeyzal,1/1/0,42,15.1%,13.7%,Bard,Support,245350
256254,Ruin,1/2/7,245,18.8%,18.3%,Aatrox,Top,245340

In [172]:
sql = """
SELECT 
Player_Nickname,
COUNT(Player_Nickname),
ROW_NUMBER() OVER (ORDER BY COUNT(Player_Nickname) DESC) Row_Number
FROM Players_stats
GROUP BY Player_Nickname
"""
pd.read_sql_query(sql, conn)

     Player_Nickname  COUNT(Player_Nickname)  Row_Number
0                                       5066           1
1                nan                    1947           2
2               Deft                     526           3
3                Bdd                     499           4
4               Kiin                     488           5
...              ...                     ...         ...
4071           32.3%                       1        4072
4072           2Axes                       1        4073
4073           29.6%                       1        4074
4074           23.7%                       1        4075
4075           19.6%                       1        4076

[4076 rows x 3 columns]

#Found another bad rows

In [173]:
sql = """
SELECT 
Player_Nickname,
COUNT(Player_Nickname) Total_Games
FROM Players_stats
WHERE Player_Nickname NOT LIKE '1%'
AND Player_Nickname NOT LIKE '2%'
AND Player_Nickname NOT LIKE '3%'
GROUP BY Player_Nickname
ORDER BY COUNT(Player_Nickname) DESC
LIMIT 20 OFFSET 2
"""
pd.read_sql_query(sql, conn)

   Player_Nickname  Total_Games
0             Deft          526
1              Bdd          499
2             Kiin          488
3            Ruler          472
4            Ghost          460
5             Khan          457
6            Chovy          446
7            Faker          440
8           Peanut          430
9        ShowMaker          429
10         Darshan          426
11           Teddy          422
12          Impact          421
13          Canyon          412
14         ssumday          404
15          Rascal          397
16           BeryL          396
17         Lehends          387
18          Hanabi          368
19            Huni          366

In [174]:
sql = """
SELECT 
Champion,
COUNT(Champion) Total_Champion_Pick,
ROW_NUMBER() OVER (ORDER BY COUNT(Champion) DESC) Row_Number
FROM Players_stats
GROUP BY Champion
"""
pd.read_sql_query(sql, conn)

     Champion  Total_Champion_Pick  Row_Number
0      Ezreal                 6445           1
1    Nautilus                 6332           2
2         Lee                 5787           3
3      Thresh                 5481           4
4    Aphelios                 5255           5
..        ...                  ...         ...
154  Katarina                   31         155
155     Shaco                   30         156
156     Annie                   29         157
157     Garen                   25         158
158     Teemo                   16         159

[159 rows x 3 columns]

In [186]:
sql = """
SELECT 
*
FROM team_stats
JOIN General_data
ON General_data.Match_id = team_stats.Match_id 
WHERE General_data.Match_id = '391210'
"""
pd.read_sql_query(sql, conn)

,Club_Name,Result,Kills,First_Blood,Towers,First_Tower,Dragons,Barons,Gold,Ban_1,...,Pick_4,Pick_5,Match_id,Match_id,Date,Blue_Team,Red_Team,Tournament,Time,Game_Version
0,Fenerbah√ße Academy,WIN,17,1.0,11,1,3,1,65.5k,Ryze,...,Xayah,Rakan,391210,391210,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,33:41,v12.5
1,Dark Passage Academy,LOSS,17,0.0,1,0,2,0,57.3k,Irelia,...,Jinx,Leona,391210,391210,2022-03-21 (SEMIFINALS),FB,DP,Turkey Academy Winter Playoffs 2022,33:41,v12.5